service/src/test/resources/putDDVMetadataRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dgws="http://www.medcom.dk/dgws/2006/04/dgws-1.0.xsd" xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <PutMetadataRequest xmlns="http://nsi.dk/bemyndigelse/2017/08/01/">
            <Domain>Trifork</Domain>
            <SystemId>DDV</SystemId>
            <SystemLongName>Det Danske Vaccinationsregister</SystemLongName>
            <Permission>
                <PermissionId>SeVaccinationer</PermissionId>
                <PermissionDescription>Se Vaccinationer</PermissionDescription>
            </Permission>
            <Permission>
                <PermissionId>VaccinationVedligehold</PermissionId>
                <PermissionDescription>Opret, ret eller slet vaccinationer</PermissionDescription>
            </Permission>
            <Permission>
                <PermissionId>VaccinationVedligeholdAnbefalet</PermissionId>
                <PermissionDescription>Opret, ret eller slet anbefalede vaccinationer</PermissionDescription>
            </Permission>
            <Permission>
                <PermissionId>VaccinationGodkend</PermissionId>
                <PermissionDescription>Godkend Vaccinationer</PermissionDescription>
            </Permission>
            <Permission>
                <PermissionId>NogetIngenHar</PermissionId>
                <PermissionDescription>En rettighed ingen kan delegere</PermissionDescription>
            </Permission>
            <EnableAsteriskPermission>true</EnableAsteriskPermission>
            <Role>
                <RoleId>Læge</RoleId>
                <RoleDescription>Læge</RoleDescription>
                <EducationCodes>
                    <EducationCode>7170</EducationCode>
                </EducationCodes>
                <DelegatablePermissions>
                    <PermissionId>SeVaccinationer</PermissionId>
                    <PermissionId>VaccinationVedligehold</PermissionId>
                    <PermissionId>VaccinationVedligeholdAnbefalet</PermissionId>
                </DelegatablePermissions>
            </Role>
            <Role>
                <RoleId>Tandlæge</RoleId>
                <RoleDescription>Tandlæge</RoleDescription>
                <EducationCodes>
                    <EducationCode>5433</EducationCode>
                </EducationCodes>
                <DelegatablePermissions>
                    <PermissionId>SeVaccinationer</PermissionId>
                    <PermissionId>VaccinationVedligehold</PermissionId>
                    <PermissionId>VaccinationVedligeholdAnbefalet</PermissionId>
                </DelegatablePermissions>
            </Role>
            <Role>
                <RoleId>Sygeplejerske</RoleId>
                <RoleDescription>Sygeplejerske</RoleDescription>
                <EducationCodes>
                    <EducationCode>5166</EducationCode>
                </EducationCodes>
                <DelegatablePermissions>
                    <PermissionId>SeVaccinationer</PermissionId>
                    <PermissionId>VaccinationGodkend</PermissionId>
                </DelegatablePermissions>
            </Role>
        </PutMetadataRequest>
    </soapenv:Body>
</soapenv:Envelope>
